[Killed] ObjectLiteral
api/papers/[id]/route.ts:83:31
 const MAX_ABSTRACT_LENGTH = 191;
 const abstractSchema = z.string().max(MAX_ABSTRACT_LENGTH);
 
-const updateSchema = z.object({
-  title: z.string().min(3).max(191).optional(),
-  abstract: abstractSchema.optional(),
-  status: z.string().optional(),
-  isDeleted: z.boolean().optional(),
-});
+const updateSchema = z.object({});
 
 const isPaperStatus = (value: unknown): value is PaperStatus =>
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] EqualityOperator
api/papers/[id]/route.ts:91:3
 });
 
 const isPaperStatus = (value: unknown): value is PaperStatus =>
-  typeof value === "string" &&
+  typeof value !== "string" &&
   PAPER_STATUSES.includes(value as PaperStatus);
 
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
api/papers/[id]/route.ts:101:30
   const params = await context.params;
   const auth = authorizeRequest(req);
   if (!auth.authorized) {
-    return NextResponse.json({ error: auth.message }, { status: 401 });
+    return NextResponse.json({}, { status: 401 });
   }
   if (!hasWritePermission(auth.role)) {
killedBy: PATCH /api/papers/[id] rejects unauthorized requests
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BooleanLiteral
api/papers/[id]/route.ts:103:7
   if (!auth.authorized) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
-  if (!hasWritePermission(auth.role)) {
+  if (hasWritePermission(auth.role)) {
     return NextResponse.json(
       { error: "Insufficient permissions." },
killedBy: PATCH /api/papers/[id] rejects read-only roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] StringLiteral
api/papers/[id]/route.ts:105:16
   }
   if (!hasWritePermission(auth.role)) {
     return NextResponse.json(
-      { error: "Insufficient permissions." },
+      { error: "" },
       { status: 403 },
     );
killedBy: PATCH /api/papers/[id] rejects read-only roles
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Insufficient permissions/i
Received string:  ""

[Killed] ConditionalExpression
api/papers/[id]/route.ts:111:7
   }
 
   const parsed = paramsSchema.safeParse(params);
-  if (!parsed.success) {
+  if (true) {
     return NextResponse.json(
       { error: "Invalid paper ID." },
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Include at least one field/i
Received string:  "Invalid paper ID."

[Killed] BlockStatement
api/papers/[id]/route.ts:119:25
   }
 
   const payload = updateSchema.safeParse(await req.json().catch(() => ({})));
-  if (!payload.success) {
-    return NextResponse.json(
-      { error: "Invalid payload." },
-      { status: 400 },
-    );
-  }
+  if (!payload.success) {}
 
   const updateData: Record<string, unknown> = {};
killedBy: PATCH /api/papers/[id] rejects payloads that fail schema validation
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
api/papers/[id]/route.ts:127:7
   }
 
   const updateData: Record<string, unknown> = {};
-  if (payload.data.title) {
+  if (true) {
     updateData.title = payload.data.title;
   }
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
api/papers/[id]/route.ts:134:28
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
-  if (payload.data.status) {
-    if (!isPaperStatus(payload.data.status)) {
-      return NextResponse.json(
-        { error: "Unsupported status value." },
-        { status: 400 },
-      );
-    }
-    updateData.status = payload.data.status;
-  }
+  if (payload.data.status) {}
 
   if (payload.data.isDeleted !== undefined) {
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,7 @@
  Object {
    "data": Object {

[Killed] ConditionalExpression
api/papers/[id]/route.ts:135:9
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
   if (payload.data.status) {
-    if (!isPaperStatus(payload.data.status)) {
+    if (true) {
       return NextResponse.json(
         { error: "Unsupported status value." },
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
api/papers/[id]/route.ts:144:7
     updateData.status = payload.data.status;
   }
 
-  if (payload.data.isDeleted !== undefined) {
+  if (true) {
       updateData.isDeleted = payload.data.isDeleted;
   }
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] EqualityOperator
api/papers/[id]/route.ts:144:7
     updateData.status = payload.data.status;
   }
 
-  if (payload.data.isDeleted !== undefined) {
+  if (payload.data.isDeleted === undefined) {
       updateData.isDeleted = payload.data.isDeleted;
   }
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
api/papers/[id]/route.ts:157:14
 
   try {
     const updated = await prisma.paper.update({
-      where: { id: parsed.data.id },
+      where: {},
       data: updateData,
     });
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "status": "Draft",

[Killed] ObjectLiteral
api/papers/[id]/route.ts:161:30
       data: updateData,
     });
 
-    return NextResponse.json({ paper: updated });
+    return NextResponse.json({});
   } catch (error) {
     console.error("Failed to update paper", error);
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1}
Received: undefined

[Killed] ConditionalExpression
api/papers/[id]/route.ts:164:9
     return NextResponse.json({ paper: updated });
   } catch (error) {
     console.error("Failed to update paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
+    if (true) {
       return NextResponse.json(
         { error: `Database error: ${error.message}` },
killedBy: PATCH /api/papers/[id] maps validation errors
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Validation error/i
Received string:  "Database error: invalid"
