[Killed] ConditionalExpression
api/auth/login/route.ts:65:11
     const userRole =
       rawRole === "research_admin"
         ? "admin"
-        : rawRole === "pi"
+        : true
           ? "principal_investigator"
           : rawRole || "viewer";
killedBy: /api/auth/login POST handler returns external role names plus BigInt IDs when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "external_partner"
Received: "principal_investigator"
