[Killed] ConditionalExpression
app/api/papers/route.ts:38:23
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
   const statusFilter = searchParams.get("status") ?? "";
-  const showDeleted = searchParams.get("deleted") === "true";
+  const showDeleted = false;
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
killedBy: /api/papers route handlers rejects deleted listings for viewers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 500

[Killed] BooleanLiteral
app/api/papers/route.ts:41:22
   const showDeleted = searchParams.get("deleted") === "true";
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
-  if (showDeleted && !isRestrictedRole) {
+  if (showDeleted && isRestrictedRole) {
     return NextResponse.json(
       { error: "You do not have permission to view deleted papers." },
killedBy: /api/papers route handlers rejects deleted listings for viewers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] BlockStatement
app/api/papers/route.ts:52:47
     isDeleted: showDeleted ? true : false,
   };
 
-  if (statusFilter && statusFilter !== "All") {
-    whereClause.status = statusFilter;
-  }
+  if (statusFilter && statusFilter !== "All") {}
 
   if (!isRestrictedRole) {
killedBy: /api/papers route handlers honors status filters and search terms
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Draft"
Received: undefined

[Killed] BooleanLiteral
app/api/papers/route.ts:198:7
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
  
-  if (!hasWritePermission(auth.role)) {
+  if (hasWritePermission(auth.role)) {
     return NextResponse.json(
         { error: "Insufficient permissions." },
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:198:7
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
  
-  if (!hasWritePermission(auth.role)) {
+  if (true) {
     return NextResponse.json(
         { error: "Insufficient permissions." },
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:207:22
 
   const { searchParams } = new URL(req.url);
   const id = searchParams.get("id");
-  const hardDelete = searchParams.get("hard") === "true";
+  const hardDelete = true;
 
   if (!id) {
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /soft deleted/i
Received string:  "Paper hard deleted successfully."

[Killed] ConditionalExpression
app/api/papers/route.ts:207:22
 
   const { searchParams } = new URL(req.url);
   const id = searchParams.get("id");
-  const hardDelete = searchParams.get("hard") === "true";
+  const hardDelete = false;
 
   if (!id) {
killedBy: /api/papers route handlers DELETE calls hard delete when hard=true and caller is admin
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /hard deleted/i
Received string:  "Paper soft deleted successfully."

[Killed] BooleanLiteral
app/api/papers/route.ts:209:7
   const id = searchParams.get("id");
   const hardDelete = searchParams.get("hard") === "true";
 
-  if (!id) {
+  if (id) {
     return NextResponse.json({ error: "Paper ID is required." }, { status: 400 });
   }
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[NoCoverage] StringLiteral
app/api/papers/route.ts:210:39
   const hardDelete = searchParams.get("hard") === "true";
 
   if (!id) {
-    return NextResponse.json({ error: "Paper ID is required." }, { status: 400 });
+    return NextResponse.json({ error: "" }, { status: 400 });
   }
 

[Killed] EqualityOperator
app/api/papers/route.ts:213:21
     return NextResponse.json({ error: "Paper ID is required." }, { status: 400 });
   }
 
-  if (hardDelete && auth.role !== "admin") {
+  if (hardDelete && auth.role === "admin") {
     return NextResponse.json(
       { error: "Hard deletes are reserved for administrator roles." },
killedBy: /api/papers route handlers DELETE calls hard delete when hard=true and caller is admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:213:21
     return NextResponse.json({ error: "Paper ID is required." }, { status: 400 });
   }
 
-  if (hardDelete && auth.role !== "admin") {
+  if (hardDelete && true) {
     return NextResponse.json(
       { error: "Hard deletes are reserved for administrator roles." },
killedBy: /api/papers route handlers DELETE calls hard delete when hard=true and caller is admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] BlockStatement
app/api/papers/route.ts:220:7
     );
   }
 
-  try {
-    const configuredActorId = Number(process.env.NEXT_PUBLIC_DEFAULT_ACTOR_ID ?? 1);
-    const actorId = Number.isFinite(configuredActorId) && configuredActorId > 0
-      ? configuredActorId
-      : 1;
-
-    if (hardDelete) {
-      await prisma.$executeRaw`CALL sp_hard_delete_paper(${parseInt(id)}, ${actorId})`;
-      return NextResponse.json(
-        { message: "Paper hard deleted successfully." },
-        { status: 200 },
-      );
-    }
-
-    await prisma.$executeRaw`CALL sp_soft_delete_paper(${parseInt(id)}, ${actorId})`;
-
-    return NextResponse.json(
-      { message: "Paper soft deleted successfully." },
-      { status: 200 },
-    );
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     console.error("Failed to delete paper", error);
     return NextResponse.json(
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Survived] LogicalOperator
app/api/papers/route.ts:221:38
   }
 
   try {
-    const configuredActorId = Number(process.env.NEXT_PUBLIC_DEFAULT_ACTOR_ID ?? 1);
+    const configuredActorId = Number(process.env.NEXT_PUBLIC_DEFAULT_ACTOR_ID && 1);
     const actorId = Number.isFinite(configuredActorId) && configuredActorId > 0
       ? configuredActorId

[Survived] EqualityOperator
app/api/papers/route.ts:222:59
 
   try {
     const configuredActorId = Number(process.env.NEXT_PUBLIC_DEFAULT_ACTOR_ID ?? 1);
-    const actorId = Number.isFinite(configuredActorId) && configuredActorId > 0
+    const actorId = Number.isFinite(configuredActorId) && configuredActorId >= 0
       ? configuredActorId
       : 1;

[Survived] ConditionalExpression
app/api/papers/route.ts:222:59
 
   try {
     const configuredActorId = Number(process.env.NEXT_PUBLIC_DEFAULT_ACTOR_ID ?? 1);
-    const actorId = Number.isFinite(configuredActorId) && configuredActorId > 0
+    const actorId = Number.isFinite(configuredActorId) && true
       ? configuredActorId
       : 1;

[Killed] ConditionalExpression
app/api/papers/route.ts:226:9
       ? configuredActorId
       : 1;
 
-    if (hardDelete) {
+    if (false) {
       await prisma.$executeRaw`CALL sp_hard_delete_paper(${parseInt(id)}, ${actorId})`;
       return NextResponse.json(
killedBy: /api/papers route handlers DELETE calls hard delete when hard=true and caller is admin
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /hard deleted/i
Received string:  "Paper soft deleted successfully."

[Killed] ConditionalExpression
app/api/papers/route.ts:226:9
       ? configuredActorId
       : 1;
 
-    if (hardDelete) {
+    if (true) {
       await prisma.$executeRaw`CALL sp_hard_delete_paper(${parseInt(id)}, ${actorId})`;
       return NextResponse.json(
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /soft deleted/i
Received string:  "Paper hard deleted successfully."

[Killed] StringLiteral
app/api/papers/route.ts:227:31
       : 1;
 
     if (hardDelete) {
-      await prisma.$executeRaw`CALL sp_hard_delete_paper(${parseInt(id)}, ${actorId})`;
+      await prisma.$executeRaw``;
       return NextResponse.json(
         { message: "Paper hard deleted successfully." },
killedBy: /api/papers route handlers DELETE calls hard delete when hard=true and caller is admin
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "sp_hard_delete_paper"
Received string:    ""

[Killed] StringLiteral
app/api/papers/route.ts:234:29
       );
     }
 
-    await prisma.$executeRaw`CALL sp_soft_delete_paper(${parseInt(id)}, ${actorId})`;
+    await prisma.$executeRaw``;
 
     return NextResponse.json(
killedBy: /api/papers route handlers DELETE calls soft delete when no hard parameter is provided
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "sp_soft_delete_paper"
Received string:    ""

[Survived] ObjectLiteral
app/api/papers/route.ts:238:7
 
     return NextResponse.json(
       { message: "Paper soft deleted successfully." },
-      { status: 200 },
+      {},
     );
   } catch (error: unknown) {

[NoCoverage] BlockStatement
app/api/papers/route.ts:240:28
       { message: "Paper soft deleted successfully." },
       { status: 200 },
     );
-  } catch (error: unknown) {
-    console.error("Failed to delete paper", error);
-    return NextResponse.json(
-      { error: "Database error during delete operation." },
-      { status: 500 },
-    );
-  }
+  } catch (error: unknown) {}
 }
 

[NoCoverage] StringLiteral
app/api/papers/route.ts:241:19
       { status: 200 },
     );
   } catch (error: unknown) {
-    console.error("Failed to delete paper", error);
+    console.error("", error);
     return NextResponse.json(
       { error: "Database error during delete operation." },
