[Killed] BlockStatement
api/auth/login/route.ts:5:28
 import { prisma } from "@/lib/prisma";
 import { SignJWT } from "jose";
 
-function getJwtSecretKey() {
-  const secret = process.env.JWT_SECRET;
-  if (!secret) {
-    throw new Error("JWT_SECRET environment variable is not set");
-  }
-  return new TextEncoder().encode(secret);
-}
+function getJwtSecretKey() {}
 
 export async function POST(request: NextRequest) {
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
api/auth/login/route.ts:7:7
 
 function getJwtSecretKey() {
   const secret = process.env.JWT_SECRET;
-  if (!secret) {
+  if (true) {
     throw new Error("JWT_SECRET environment variable is not set");
   }
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] StringLiteral
api/auth/login/route.ts:8:21
 function getJwtSecretKey() {
   const secret = process.env.JWT_SECRET;
   if (!secret) {
-    throw new Error("JWT_SECRET environment variable is not set");
+    throw new Error("");
   }
   return new TextEncoder().encode(secret);

[Killed] BlockStatement
api/auth/login/route.ts:15:7
 
 export async function POST(request: NextRequest) {
   let payload;
-  try {
-    payload = await request.json();
-  } catch {
+  try {} catch {
     return NextResponse.json({ error: "Invalid JSON format." }, { status: 400 });
   }
killedBy: /api/auth/login POST handler reject missing JSON payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid JSON format."
Received: "Email and password are required."

[Killed] BlockStatement
api/auth/login/route.ts:17:11
   let payload;
   try {
     payload = await request.json();
-  } catch {
-    return NextResponse.json({ error: "Invalid JSON format." }, { status: 400 });
-  }
+  } catch {}
 
   const { username, email, password } = payload ?? {};
killedBy: /api/auth/login POST handler reject missing JSON payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid JSON format."
Received: "Email and password are required."

[Killed] ObjectLiteral
api/auth/login/route.ts:18:65
   try {
     payload = await request.json();
   } catch {
-    return NextResponse.json({ error: "Invalid JSON format." }, { status: 400 });
+    return NextResponse.json({ error: "Invalid JSON format." }, {});
   }
 
killedBy: /api/auth/login POST handler reject missing JSON payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] LogicalOperator
api/auth/login/route.ts:21:41
     return NextResponse.json({ error: "Invalid JSON format." }, { status: 400 });
   }
 
-  const { username, email, password } = payload ?? {};
+  const { username, email, password } = payload && {};
   const identifier =
     (typeof username === "string" && username.trim()) ||
killedBy: /api/auth/login POST handler returns 404 if user is not found by identifier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] EqualityOperator
api/auth/login/route.ts:23:6
 
   const { username, email, password } = payload ?? {};
   const identifier =
-    (typeof username === "string" && username.trim()) ||
+    (typeof username !== "string" && username.trim()) ||
     (typeof email === "string" && email.trim());
 
killedBy: /api/auth/login POST handler rejects missing username/email or password
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
api/auth/login/route.ts:23:6
 
   const { username, email, password } = payload ?? {};
   const identifier =
-    (typeof username === "string" && username.trim()) ||
+    (false) ||
     (typeof email === "string" && email.trim());
 
killedBy: /api/auth/login POST handler returns 404 if user is not found by identifier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] ConditionalExpression
api/auth/login/route.ts:24:6
   const { username, email, password } = payload ?? {};
   const identifier =
     (typeof username === "string" && username.trim()) ||
-    (typeof email === "string" && email.trim());
+    (true && email.trim());
 
   if (!identifier || !password) {
killedBy: /api/auth/login POST handler rejects missing username/email or password
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] LogicalOperator
api/auth/login/route.ts:24:6
   const { username, email, password } = payload ?? {};
   const identifier =
     (typeof username === "string" && username.trim()) ||
-    (typeof email === "string" && email.trim());
+    (typeof email === "string" || email.trim());
 
   if (!identifier || !password) {
killedBy: /api/auth/login POST handler rejects missing username/email or password
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
api/auth/login/route.ts:26:7
     (typeof username === "string" && username.trim()) ||
     (typeof email === "string" && email.trim());
 
-  if (!identifier || !password) {
+  if (false) {
     return NextResponse.json(
       { error: "Email and password are required." },
killedBy: /api/auth/login POST handler rejects missing username/email or password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
api/auth/login/route.ts:26:7
     (typeof username === "string" && username.trim()) ||
     (typeof email === "string" && email.trim());
 
-  if (!identifier || !password) {
+  if (true) {
     return NextResponse.json(
       { error: "Email and password are required." },
killedBy: /api/auth/login POST handler returns 404 if user is not found by identifier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] StringLiteral
api/auth/login/route.ts:28:16
 
   if (!identifier || !password) {
     return NextResponse.json(
-      { error: "Email and password are required." },
+      { error: "" },
       { status: 400 },
     );
killedBy: /api/auth/login POST handler rejects missing username/email or password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email and password are required."
Received: ""

[Killed] ConditionalExpression
api/auth/login/route.ts:35:9
 
   try {
     const orConditions: Array<Record<string, unknown>> = [];
-    if (identifier) {
+    if (false) {
       const variants = Array.from(
         new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": []}}

Number of calls: 1

[Killed] BlockStatement
api/auth/login/route.ts:35:21
 
   try {
     const orConditions: Array<Record<string, unknown>> = [];
-    if (identifier) {
-      const variants = Array.from(
-        new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
-      );
-      variants.forEach((value) => {
-        if (value) {
-          orConditions.push({ email: { equals: value } });
-          orConditions.push({ userName: { equals: value } });
-        }
-      });
-    }
+    if (identifier) {}
 
     const user = await prisma.user.findFirst({
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": []}}

Number of calls: 1

[Killed] MethodExpression
api/auth/login/route.ts:37:30
     const orConditions: Array<Record<string, unknown>> = [];
     if (identifier) {
       const variants = Array.from(
-        new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
+        new Set([identifier, identifier.toUpperCase(), identifier.toUpperCase()]),
       );
       variants.forEach((value) => {
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": [{"email": {"equals": "ADMIN@EXAMPLE.COM"

[Survived] MethodExpression
api/auth/login/route.ts:37:56
     const orConditions: Array<Record<string, unknown>> = [];
     if (identifier) {
       const variants = Array.from(
-        new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
+        new Set([identifier, identifier.toLowerCase(), identifier.toLowerCase()]),
       );
       variants.forEach((value) => {

[Killed] BlockStatement
api/auth/login/route.ts:39:35
       const variants = Array.from(
         new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
       );
-      variants.forEach((value) => {
-        if (value) {
-          orConditions.push({ email: { equals: value } });
-          orConditions.push({ userName: { equals: value } });
-        }
-      });
+      variants.forEach((value) => {});
     }
 
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": []}}

Number of calls: 1

[Killed] BlockStatement
api/auth/login/route.ts:40:20
         new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
       );
       variants.forEach((value) => {
-        if (value) {
-          orConditions.push({ email: { equals: value } });
-          orConditions.push({ userName: { equals: value } });
-        }
+        if (value) {}
       });
     }
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": []}}

Number of calls: 1

[Killed] ConditionalExpression
api/auth/login/route.ts:40:13
         new Set([identifier, identifier.toLowerCase(), identifier.toUpperCase()]),
       );
       variants.forEach((value) => {
-        if (value) {
+        if (false) {
           orConditions.push({ email: { equals: value } });
           orConditions.push({ userName: { equals: value } });
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {"include": {"role": true}, "where": {"OR": []}}

Number of calls: 1

[Killed] ObjectLiteral
api/auth/login/route.ts:47:46
       });
     }
 
-    const user = await prisma.user.findFirst({
-      where: { OR: orConditions },
-      include: { role: true },
-    });
+    const user = await prisma.user.findFirst({});
 
     if (!user) {
killedBy: /api/auth/login POST handler performs case-insensitive lookup for email or username
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"OR": ArrayContaining [{"email": {"equals": "ADMIN@EXAMPLE.COM"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}, {"email": {"equals": "admin@example.com"}}, {"userName": {"equals": "ADMIN@EXAMPLE.COM"}}]}}
Received: {}

Number of calls: 1

[Survived] BooleanLiteral
api/auth/login/route.ts:49:24
 
     const user = await prisma.user.findFirst({
       where: { OR: orConditions },
-      include: { role: true },
+      include: { role: false },
     });
 

[Killed] BlockStatement
api/auth/login/route.ts:52:16
       include: { role: true },
     });
 
-    if (!user) {
-      return NextResponse.json({ error: "User not found." }, { status: 404 });
-    }
+    if (!user) {}
 
     const isPasswordValid = user.password === password;
killedBy: /api/auth/login POST handler returns 404 if user is not found by identifier
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
api/auth/login/route.ts:56:29
       return NextResponse.json({ error: "User not found." }, { status: 404 });
     }
 
-    const isPasswordValid = user.password === password;
+    const isPasswordValid = false;
     if (!isPasswordValid) {
       return NextResponse.json({ error: "Invalid password." }, { status: 401 });
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] EqualityOperator
api/auth/login/route.ts:56:29
       return NextResponse.json({ error: "User not found." }, { status: 404 });
     }
 
-    const isPasswordValid = user.password === password;
+    const isPasswordValid = user.password !== password;
     if (!isPasswordValid) {
       return NextResponse.json({ error: "Invalid password." }, { status: 401 });
killedBy: /api/auth/login POST handler returns 401 on incorrect password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ConditionalExpression
api/auth/login/route.ts:57:9
     }
 
     const isPasswordValid = user.password === password;
-    if (!isPasswordValid) {
+    if (true) {
       return NextResponse.json({ error: "Invalid password." }, { status: 401 });
     }
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BlockStatement
api/auth/login/route.ts:57:27
     }
 
     const isPasswordValid = user.password === password;
-    if (!isPasswordValid) {
-      return NextResponse.json({ error: "Invalid password." }, { status: 401 });
-    }
+    if (!isPasswordValid) {}
 
     const rawRole = user.role.roleName?.toLowerCase().replace(/\s+/g, "_");
killedBy: /api/auth/login POST handler returns 401 on incorrect password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] MethodExpression
api/auth/login/route.ts:61:21
       return NextResponse.json({ error: "Invalid password." }, { status: 401 });
     }
 
-    const rawRole = user.role.roleName?.toLowerCase().replace(/\s+/g, "_");
+    const rawRole = user.role.roleName?.toUpperCase().replace(/\s+/g, "_");
     const userRole =
       rawRole === "research_admin"
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin"
Received: "RESEARCH_ADMIN"

[Survived] OptionalChaining
api/auth/login/route.ts:61:21
       return NextResponse.json({ error: "Invalid password." }, { status: 401 });
     }
 
-    const rawRole = user.role.roleName?.toLowerCase().replace(/\s+/g, "_");
+    const rawRole = user.role.roleName.toLowerCase().replace(/\s+/g, "_");
     const userRole =
       rawRole === "research_admin"

[Killed] ConditionalExpression
api/auth/login/route.ts:63:7
 
     const rawRole = user.role.roleName?.toLowerCase().replace(/\s+/g, "_");
     const userRole =
-      rawRole === "research_admin"
+      false
         ? "admin"
         : rawRole === "pi"
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin"
Received: "research_admin"

[Killed] ConditionalExpression
api/auth/login/route.ts:63:7
 
     const rawRole = user.role.roleName?.toLowerCase().replace(/\s+/g, "_");
     const userRole =
-      rawRole === "research_admin"
+      true
         ? "admin"
         : rawRole === "pi"
killedBy: /api/auth/login POST handler returns 200 and maps PI role correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "principal_investigator"
Received: "admin"

[Survived] EqualityOperator
api/auth/login/route.ts:65:11
     const userRole =
       rawRole === "research_admin"
         ? "admin"
-        : rawRole === "pi"
+        : rawRole !== "pi"
           ? "principal_investigator"
           : rawRole || "viewer";

[Survived] ConditionalExpression
api/auth/login/route.ts:65:11
     const userRole =
       rawRole === "research_admin"
         ? "admin"
-        : rawRole === "pi"
+        : false
           ? "principal_investigator"
           : rawRole || "viewer";

[NoCoverage] StringLiteral
api/auth/login/route.ts:66:13
       rawRole === "research_admin"
         ? "admin"
         : rawRole === "pi"
-          ? "principal_investigator"
+          ? ""
           : rawRole || "viewer";
     const numericId =

[Killed] ConditionalExpression
api/auth/login/route.ts:67:13
         ? "admin"
         : rawRole === "pi"
           ? "principal_investigator"
-          : rawRole || "viewer";
+          : true;
     const numericId =
       typeof user.id === "bigint" ? Number(user.id) : Number(user.id ?? 0);
killedBy: /api/auth/login POST handler returns 200 and maps PI role correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "principal_investigator"
Received: true

[Killed] LogicalOperator
api/auth/login/route.ts:67:13
         ? "admin"
         : rawRole === "pi"
           ? "principal_investigator"
-          : rawRole || "viewer";
+          : rawRole && "viewer";
     const numericId =
       typeof user.id === "bigint" ? Number(user.id) : Number(user.id ?? 0);
killedBy: /api/auth/login POST handler returns 200 and maps PI role correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "principal_investigator"
Received: "viewer"

[Killed] LogicalOperator
api/auth/login/route.ts:69:62
           ? "principal_investigator"
           : rawRole || "viewer";
     const numericId =
-      typeof user.id === "bigint" ? Number(user.id) : Number(user.id ?? 0);
+      typeof user.id === "bigint" ? Number(user.id) : Number(user.id && 0);
 
     const token = await new SignJWT({ userId: numericId, role: userRole, userName: user.userName })
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] EqualityOperator
api/auth/login/route.ts:69:7
           ? "principal_investigator"
           : rawRole || "viewer";
     const numericId =
-      typeof user.id === "bigint" ? Number(user.id) : Number(user.id ?? 0);
+      typeof user.id !== "bigint" ? Number(user.id) : Number(user.id ?? 0);
 
     const token = await new SignJWT({ userId: numericId, role: userRole, userName: user.userName })

[Killed] StringLiteral
api/auth/login/route.ts:74:26
     const token = await new SignJWT({ userId: numericId, role: userRole, userName: user.userName })
       .setProtectedHeader({ alg: "HS256" })
       .setIssuedAt()
-      .setExpirationTime("24h")
+      .setExpirationTime("")
       .sign(getJwtSecretKey());
 
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ObjectLiteral
api/auth/login/route.ts:84:74
       role: userRole,
     };
 
-    const response = NextResponse.json({ token, user: responsePayload }, { status: 200 });
+    const response = NextResponse.json({ token, user: responsePayload }, {});
 
     response.cookies.set({

[Killed] ObjectLiteral
api/auth/login/route.ts:86:26
 
     const response = NextResponse.json({ token, user: responsePayload }, { status: 200 });
 
-    response.cookies.set({
-      name: "auth_token",
-      value: token,
-      httpOnly: true,
-      secure: process.env.NODE_ENV === "production",
-      sameSite: "strict",
-      maxAge: 24 * 60 * 60,
-      path: "/",
-    });
+    response.cookies.set({});
 
     return response;
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^auth_token=/
Received string:  "undefined=; Path=/"

[Killed] BooleanLiteral
api/auth/login/route.ts:89:17
     response.cookies.set({
       name: "auth_token",
       value: token,
-      httpOnly: true,
+      httpOnly: false,
       secure: process.env.NODE_ENV === "production",
       sameSite: "strict",
killedBy: /api/auth/login POST handler returns 200 and set cookie on successful login as admin
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "HttpOnly"
Received string:    "auth_token=eyJhbGciOiJIUzI1NiJ9.eyJ1c2VySWQiOjEsInJvbGUiOiJhZG1pbiIsInVzZXJOYW1lIjoiYWRtaW5Vc2VyIiwiaWF0IjoxNzY0NzI5MjgwLCJleHAiOjE3NjQ4MTU2ODB9.NgOV6fSsFZxv1IdjwR0ITkqAj-OMCgc1PjeUPrJ9I2A; Path=/; Expires=Thu, 04 Dec 2025 02:34:40 GMT; Max-Age=86400; SameSite=strict"

[Survived] StringLiteral
api/auth/login/route.ts:91:17
       value: token,
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
-      sameSite: "strict",
+      sameSite: "",
       maxAge: 24 * 60 * 60,
       path: "/",

[Survived] ArithmeticOperator
api/auth/login/route.ts:92:15
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
       sameSite: "strict",
-      maxAge: 24 * 60 * 60,
+      maxAge: 24 * 60 / 60,
       path: "/",
     });

[Survived] ArithmeticOperator
api/auth/login/route.ts:92:15
       httpOnly: true,
       secure: process.env.NODE_ENV === "production",
       sameSite: "strict",
-      maxAge: 24 * 60 * 60,
+      maxAge: 24 / 60 * 60,
       path: "/",
     });

[Killed] BlockStatement
api/auth/login/route.ts:97:19
     });
 
     return response;
-  } catch (error) {
-    console.error("Login error:", error);
-    return NextResponse.json({ error: "Internal server error." }, { status: 500 });
-  }
+  } catch (error) {}
 }
 
killedBy: /api/auth/login POST handler returns 500 for unexpected database errors
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] StringLiteral
api/auth/login/route.ts:99:39
     return response;
   } catch (error) {
     console.error("Login error:", error);
-    return NextResponse.json({ error: "Internal server error." }, { status: 500 });
+    return NextResponse.json({ error: "" }, { status: 500 });
   }
 }
killedBy: /api/auth/login POST handler returns 500 for unexpected database errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Internal server error."
Received: ""
