[Killed] BlockStatement
api/auth/logout/route.ts:3:30
 import { NextResponse } from "next/server";
 
-export async function POST() {
-    const response = NextResponse.json({ success: true }, { status: 200 });
-
-    response.cookies.set({
-        name: "auth_token",
-        value: "",
-        httpOnly: true,
-        secure: process.env.NODE_ENV === "production",
-        sameSite: "strict",
-        maxAge: 0, // Expire immediately
-        path: "/",
-    });
-
-    return response;
-}
+export async function POST() {}
killedBy: /api/auth/logout POST handler should return a 200 status and clear the auth_token cookie
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BooleanLiteral
api/auth/logout/route.ts:4:51
 import { NextResponse } from "next/server";
 
 export async function POST() {
-    const response = NextResponse.json({ success: true }, { status: 200 });
+    const response = NextResponse.json({ success: false }, { status: 200 });
 
     response.cookies.set({
killedBy: /api/auth/logout POST handler should return a 200 status and clear the auth_token cookie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "success": true,
+   "success": false,

[Killed] StringLiteral
api/auth/logout/route.ts:7:15
     const response = NextResponse.json({ success: true }, { status: 200 });
 
     response.cookies.set({
-        name: "auth_token",
+        name: "",
         value: "",
         httpOnly: true,
killedBy: /api/auth/logout POST handler should return a 200 status and clear the auth_token cookie
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "auth_token=;"
Received string:    "=; Path=/; Max-Age=0; HttpOnly; SameSite=strict"

[Killed] StringLiteral
api/auth/logout/route.ts:8:16
 
     response.cookies.set({
         name: "auth_token",
-        value: "",
+        value: "Stryker was here!",
         httpOnly: true,
         secure: process.env.NODE_ENV === "production",
killedBy: /api/auth/logout POST handler should return a 200 status and clear the auth_token cookie
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "auth_token=;"
Received string:    "auth_token=Stryker%20was%20here!; Path=/; Max-Age=0; HttpOnly; SameSite=strict"

[Killed] BooleanLiteral
api/auth/logout/route.ts:9:19
     response.cookies.set({
         name: "auth_token",
         value: "",
-        httpOnly: true,
+        httpOnly: false,
         secure: process.env.NODE_ENV === "production",
         sameSite: "strict",
killedBy: /api/auth/logout POST handler should return a 200 status and clear the auth_token cookie
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "HttpOnly"
Received string:    "auth_token=; Path=/; Max-Age=0; SameSite=strict"
