[Killed] BlockStatement
app/api/papers/route.ts:20:65
 
 const DEFAULT_PAPER_STATUS: PaperStatus = "Draft";
 
-const isPaperStatus = (value: unknown): value is PaperStatus => {
-  if (typeof value !== "string") {
-    console.error("Invalid status type received.", { value });
-    return false;
-  }
-  return PAPER_STATUSES.includes(value as PaperStatus);
-};
+const isPaperStatus = (value: unknown): value is PaperStatus => {};
 
 export async function GET(req: NextRequest) {
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": ObjectContaining {
+   "data": Object {

[Killed] ConditionalExpression
app/api/papers/route.ts:21:7
 const DEFAULT_PAPER_STATUS: PaperStatus = "Draft";
 
 const isPaperStatus = (value: unknown): value is PaperStatus => {
-  if (typeof value !== "string") {
+  if (true) {
     console.error("Invalid status type received.", { value });
     return false;
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": ObjectContaining {
+   "data": Object {

[Killed] EqualityOperator
app/api/papers/route.ts:21:7
 const DEFAULT_PAPER_STATUS: PaperStatus = "Draft";
 
 const isPaperStatus = (value: unknown): value is PaperStatus => {
-  if (typeof value !== "string") {
+  if (typeof value === "string") {
     console.error("Invalid status type received.", { value });
     return false;
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": ObjectContaining {
+   "data": Object {

[Killed] ObjectLiteral
app/api/papers/route.ts:22:52
 
 const isPaperStatus = (value: unknown): value is PaperStatus => {
   if (typeof value !== "string") {
-    console.error("Invalid status type received.", { value });
+    console.error("Invalid status type received.", {});
     return false;
   }
killedBy: /api/papers route handlers POST logs and defaults when status is not a string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Invalid status type received.",
- Object {
-   "value": 123,

[Killed] StringLiteral
app/api/papers/route.ts:22:19
 
 const isPaperStatus = (value: unknown): value is PaperStatus => {
   if (typeof value !== "string") {
-    console.error("Invalid status type received.", { value });
+    console.error("", { value });
     return false;
   }
killedBy: /api/papers route handlers POST logs and defaults when status is not a string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Invalid status type received.",
+ "",
  {"value": 123},

[Killed] BooleanLiteral
app/api/papers/route.ts:23:12
 const isPaperStatus = (value: unknown): value is PaperStatus => {
   if (typeof value !== "string") {
     console.error("Invalid status type received.", { value });
-    return false;
+    return true;
   }
   return PAPER_STATUSES.includes(value as PaperStatus);
killedBy: /api/papers route handlers POST defaults to Draft status when none is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": ObjectContaining {
-     "status": "Draft",

[Killed] BooleanLiteral
app/api/papers/route.ts:30:7
 
 export async function GET(req: NextRequest) {
   const auth = authorizeRequest(req);
-  if (!auth.authorized) {
+  if (auth.authorized) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ConditionalExpression
app/api/papers/route.ts:30:7
 
 export async function GET(req: NextRequest) {
   const auth = authorizeRequest(req);
-  if (!auth.authorized) {
+  if (false) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] LogicalOperator
app/api/papers/route.ts:34:16
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
 
-  const role = auth.role ?? "viewer";
+  const role = auth.role && "viewer";
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
killedBy: /api/papers route handlers GET includes email info for admin role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"include": ObjectContaining {"primaryContact": {"select": {"email": true, "userName": true}}}, "take": 20, "where": ObjectContaining {"isDeleted": false}}
Received: {"include": {"primaryContact": {"select": {"email": false, "userName": true}}, "topics": {"select": {"topic": true}}, "venue": true}, "orderBy": {"

[Survived] LogicalOperator
app/api/papers/route.ts:36:18
 
   const role = auth.role ?? "viewer";
   const { searchParams } = new URL(req.url);
-  const search = searchParams.get("search") ?? "";
+  const search = searchParams.get("search") && "";
   const statusFilter = searchParams.get("status") ?? "";
   const showDeleted = searchParams.get("deleted") === "true";

[Survived] LogicalOperator
app/api/papers/route.ts:37:24
   const role = auth.role ?? "viewer";
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
-  const statusFilter = searchParams.get("status") ?? "";
+  const statusFilter = searchParams.get("status") && "";
   const showDeleted = searchParams.get("deleted") === "true";
 

[Survived] StringLiteral
app/api/papers/route.ts:37:54
   const role = auth.role ?? "viewer";
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
-  const statusFilter = searchParams.get("status") ?? "";
+  const statusFilter = searchParams.get("status") ?? "Stryker was here!";
   const showDeleted = searchParams.get("deleted") === "true";
 

[Killed] ConditionalExpression
app/api/papers/route.ts:38:23
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
   const statusFilter = searchParams.get("status") ?? "";
-  const showDeleted = searchParams.get("deleted") === "true";
+  const showDeleted = true;
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] EqualityOperator
app/api/papers/route.ts:38:23
   const { searchParams } = new URL(req.url);
   const search = searchParams.get("search") ?? "";
   const statusFilter = searchParams.get("status") ?? "";
-  const showDeleted = searchParams.get("deleted") === "true";
+  const showDeleted = searchParams.get("deleted") !== "true";
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:40:28
   const statusFilter = searchParams.get("status") ?? "";
   const showDeleted = searchParams.get("deleted") === "true";
 
-  const isRestrictedRole = role === "admin" || role === "principal_investigator";
+  const isRestrictedRole = true;
   if (showDeleted && !isRestrictedRole) {
     return NextResponse.json(
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,8 +17,7 @@
      "updatedAt": "desc",
    },

[Killed] EqualityOperator
app/api/papers/route.ts:40:48
   const statusFilter = searchParams.get("status") ?? "";
   const showDeleted = searchParams.get("deleted") === "true";
 
-  const isRestrictedRole = role === "admin" || role === "principal_investigator";
+  const isRestrictedRole = role === "admin" || role !== "principal_investigator";
   if (showDeleted && !isRestrictedRole) {
     return NextResponse.json(
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,8 +17,7 @@
      "updatedAt": "desc",
    },

[Killed] ConditionalExpression
app/api/papers/route.ts:41:7
   const showDeleted = searchParams.get("deleted") === "true";
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
-  if (showDeleted && !isRestrictedRole) {
+  if (true) {
     return NextResponse.json(
       { error: "You do not have permission to view deleted papers." },
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] LogicalOperator
app/api/papers/route.ts:41:7
   const showDeleted = searchParams.get("deleted") === "true";
 
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
-  if (showDeleted && !isRestrictedRole) {
+  if (showDeleted || !isRestrictedRole) {
     return NextResponse.json(
       { error: "You do not have permission to view deleted papers." },
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[NoCoverage] StringLiteral
app/api/papers/route.ts:43:16
   const isRestrictedRole = role === "admin" || role === "principal_investigator";
   if (showDeleted && !isRestrictedRole) {
     return NextResponse.json(
-      { error: "You do not have permission to view deleted papers." },
+      { error: "" },
       { status: 403 },
     );

[Killed] BooleanLiteral
app/api/papers/route.ts:49:37
   }
 
   const whereClause: Record<string, unknown> = {
-    isDeleted: showDeleted ? true : false,
+    isDeleted: showDeleted ? true : true,
   };
 
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -16,9 +16,9 @@
    "orderBy": Object {
      "updatedAt": "desc",

[NoCoverage] BooleanLiteral
app/api/papers/route.ts:49:30
   }
 
   const whereClause: Record<string, unknown> = {
-    isDeleted: showDeleted ? true : false,
+    isDeleted: showDeleted ? false : false,
   };
 

[Survived] LogicalOperator
app/api/papers/route.ts:52:7
     isDeleted: showDeleted ? true : false,
   };
 
-  if (statusFilter && statusFilter !== "All") {
+  if (statusFilter || statusFilter !== "All") {
     whereClause.status = statusFilter;
   }

[Survived] ConditionalExpression
app/api/papers/route.ts:52:7
     isDeleted: showDeleted ? true : false,
   };
 
-  if (statusFilter && statusFilter !== "All") {
+  if (false) {
     whereClause.status = statusFilter;
   }

[Killed] BlockStatement
app/api/papers/route.ts:56:26
     whereClause.status = statusFilter;
   }
 
-  if (!isRestrictedRole) {
-    whereClause.status = "Published";
-  }
+  if (!isRestrictedRole) {}
 
   if (search) {
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,8 +17,7 @@
      "updatedAt": "desc",
    },

[Killed] ConditionalExpression
app/api/papers/route.ts:56:7
     whereClause.status = statusFilter;
   }
 
-  if (!isRestrictedRole) {
+  if (false) {
     whereClause.status = "Published";
   }
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -17,8 +17,7 @@
      "updatedAt": "desc",
    },

[NoCoverage] BlockStatement
app/api/papers/route.ts:60:15
     whereClause.status = "Published";
   }
 
-  if (search) {
-    whereClause.OR = [
-      { title: { contains: search } },
-      { abstract: { contains: search } },
-    ];
-  }
+  if (search) {}
 
   try {

[NoCoverage] ObjectLiteral
app/api/papers/route.ts:62:16
 
   if (search) {
     whereClause.OR = [
-      { title: { contains: search } },
+      { title: {} },
       { abstract: { contains: search } },
     ];

[NoCoverage] ObjectLiteral
app/api/papers/route.ts:63:19
   if (search) {
     whereClause.OR = [
       { title: { contains: search } },
-      { abstract: { contains: search } },
+      { abstract: {} },
     ];
   }

[Killed] BlockStatement
app/api/papers/route.ts:67:7
     ];
   }
 
-  try {
-    const papers = await prisma.paper.findMany({
-      take: 20,
-      where: whereClause,
-      orderBy: { updatedAt: "desc" },
-      include: {
-        venue: true,
-        primaryContact: {
-          select: { 
-            userName: true,
-            email: role === "admin" || role === "principal_investigator" ? true : false,
-          },
-        },
-        topics: {
-          select: {
-            topic: true,
-          },
-        },
-      },
-    });
-
-    return NextResponse.json({ papers });
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     console.error("Failed to fetch papers", error);
     return NextResponse.json(
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] StringLiteral
app/api/papers/route.ts:71:29
     const papers = await prisma.paper.findMany({
       take: 20,
       where: whereClause,
-      orderBy: { updatedAt: "desc" },
+      orderBy: { updatedAt: "" },
       include: {
         venue: true,
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,11 +12,11 @@
        },
      },

[Killed] BooleanLiteral
app/api/papers/route.ts:73:16
       where: whereClause,
       orderBy: { updatedAt: "desc" },
       include: {
-        venue: true,
+        venue: false,
         primaryContact: {
           select: { 
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,11 +9,11 @@
      "topics": Object {
        "select": Object {

[Killed] ObjectLiteral
app/api/papers/route.ts:74:25
       orderBy: { updatedAt: "desc" },
       include: {
         venue: true,
-        primaryContact: {
-          select: { 
-            userName: true,
-            email: role === "admin" || role === "principal_investigator" ? true : false,
-          },
-        },
+        primaryContact: {},
         topics: {
           select: {
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,13 +1,8 @@
  Object {
    "include": Object {

[Killed] BooleanLiteral
app/api/papers/route.ts:76:23
         venue: true,
         primaryContact: {
           select: { 
-            userName: true,
+            userName: false,
             email: role === "admin" || role === "principal_investigator" ? true : false,
           },
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,11 @@
  Object {
    "include": Object {

[Killed] BooleanLiteral
app/api/papers/route.ts:77:83
         primaryContact: {
           select: { 
             userName: true,
-            email: role === "admin" || role === "principal_investigator" ? true : false,
+            email: role === "admin" || role === "principal_investigator" ? true : true,
           },
         },
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "include": Object {

[Killed] ConditionalExpression
app/api/papers/route.ts:77:20
         primaryContact: {
           select: { 
             userName: true,
-            email: role === "admin" || role === "principal_investigator" ? true : false,
+            email: false ? true : false,
           },
         },
killedBy: /api/papers route handlers GET includes email info for admin role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"include": ObjectContaining {"primaryContact": {"select": {"email": true, "userName": true}}}, "take": 20, "where": ObjectContaining {"isDeleted": false}}
Received: {"include": {"primaryContact": {"select": {"email": false, "userName": true}}, "topics": {"select": {"topic": true}}, "venue": true}, "orderBy": {"

[Killed] BooleanLiteral
app/api/papers/route.ts:82:20
         },
         topics: {
           select: {
-            topic: true,
+            topic: false,
           },
         },
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,11 +6,11 @@
          "userName": true,
        },

[Killed] BlockStatement
app/api/papers/route.ts:89:28
     });
 
     return NextResponse.json({ papers });
-  } catch (error: unknown) {
-    console.error("Failed to fetch papers", error);
-    return NextResponse.json(
-      { error: "Database not ready yet. Run migrations and try again." },
-      { status: 500 },
-    );
-  }
+  } catch (error: unknown) {}
 }
 
killedBy: /api/papers route handlers GET returns 500 when Prisma query fails
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] StringLiteral
app/api/papers/route.ts:90:19
 
     return NextResponse.json({ papers });
   } catch (error: unknown) {
-    console.error("Failed to fetch papers", error);
+    console.error("", error);
     return NextResponse.json(
       { error: "Database not ready yet. Run migrations and try again." },
killedBy: /api/papers route handlers GET returns 500 when Prisma query fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to fetch papers", Any<Error>
Received: "", [Error: db down]

Number of calls: 1

[Killed] ObjectLiteral
app/api/papers/route.ts:92:7
   } catch (error: unknown) {
     console.error("Failed to fetch papers", error);
     return NextResponse.json(
-      { error: "Database not ready yet. Run migrations and try again." },
+      {},
       { status: 500 },
     );
killedBy: /api/papers route handlers GET returns 500 when Prisma query fails
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BlockStatement
app/api/papers/route.ts:100:25
 
 export async function POST(req: NextRequest) {
   const auth = authorizeRequest(req);
-  if (!auth.authorized) {
-    return NextResponse.json({ error: auth.message }, { status: 401 });
-  }
+  if (!auth.authorized) {}
   if (!hasWritePermission(auth.role)) {
     return NextResponse.json(
killedBy: /api/papers route handlers POST rejects missing authorization header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:103:7
   if (!auth.authorized) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
-  if (!hasWritePermission(auth.role)) {
+  if (true) {
     return NextResponse.json(
       { error: "Insufficient permissions." },
killedBy: /api/papers route handlers POST validates required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 403

[Killed] ConditionalExpression
app/api/papers/route.ts:103:7
   if (!auth.authorized) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
-  if (!hasWritePermission(auth.role)) {
+  if (false) {
     return NextResponse.json(
       { error: "Insufficient permissions." },
killedBy: /api/papers route handlers POST rejects when user lacks write permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 400

[Killed] ObjectLiteral
app/api/papers/route.ts:106:7
   if (!hasWritePermission(auth.role)) {
     return NextResponse.json(
       { error: "Insufficient permissions." },
-      { status: 403 },
+      {},
     );
   }
killedBy: /api/papers route handlers POST rejects when user lacks write permissions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] BlockStatement
app/api/papers/route.ts:111:7
   }
 
   let payload: PaperPayload;
-  try {
-    payload = await req.json();
-  } catch {
+  try {} catch {
     return NextResponse.json(
       { error: "Invalid JSON in request body." },
killedBy: /api/papers route handlers POST rejects invalid JSON payloads
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid JSON/i
Received string:  "title and primaryContactId are required"

[Killed] BlockStatement
app/api/papers/route.ts:113:11
   let payload: PaperPayload;
   try {
     payload = await req.json();
-  } catch {
-    return NextResponse.json(
-      { error: "Invalid JSON in request body." },
-      { status: 400 },
-    );
-  }
+  } catch {}
 
   if (!payload || !payload.title || !payload.primaryContactId) {
killedBy: /api/papers route handlers POST rejects invalid JSON payloads
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid JSON/i
Received string:  "title and primaryContactId are required"

[Killed] ConditionalExpression
app/api/papers/route.ts:120:7
     );
   }
 
-  if (!payload || !payload.title || !payload.primaryContactId) {
+  if (false) {
     return NextResponse.json(
       { error: "title and primaryContactId are required" },
killedBy: /api/papers route handlers POST validates required fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /title and primaryContactId are required/i
Received string:  "primaryContactId does not exist."

[Killed] ConditionalExpression
app/api/papers/route.ts:120:7
     );
   }
 
-  if (!payload || !payload.title || !payload.primaryContactId) {
+  if (false || !payload.primaryContactId) {
     return NextResponse.json(
       { error: "title and primaryContactId are required" },
killedBy: /api/papers route handlers POST handles null JSON payloads gracefully
statusReason: TypeError: Cannot read properties of null (reading 'primaryContactId')

[Killed] StringLiteral
app/api/papers/route.ts:122:16
 
   if (!payload || !payload.title || !payload.primaryContactId) {
     return NextResponse.json(
-      { error: "title and primaryContactId are required" },
+      { error: "" },
       { status: 400 },
     );
killedBy: /api/papers route handlers POST validates required fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /title and primaryContactId are required/i
Received string:  ""

[Killed] ObjectLiteral
app/api/papers/route.ts:122:7
 
   if (!payload || !payload.title || !payload.primaryContactId) {
     return NextResponse.json(
-      { error: "title and primaryContactId are required" },
+      {},
       { status: 400 },
     );
killedBy: /api/papers route handlers POST validates required fields
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ArrayDeclaration
app/api/papers/route.ts:127:58
     );
   }
 
-  const [contactExists, venueExists] = await Promise.all([
-    prisma.user.count({ where: { id: payload.primaryContactId } }),
-    payload.venueId
-      ? prisma.venue.count({ where: { id: payload.venueId } })
-      : Promise.resolve(1),
-  ]);
+  const [contactExists, venueExists] = await Promise.all([]);
 
   if (!contactExists) {
killedBy: /api/papers route handlers POST returns 400 when venue does not exist
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /venueId does not exist/i
Received string:  "primaryContactId does not exist."

[Killed] ObjectLiteral
app/api/papers/route.ts:130:37
   const [contactExists, venueExists] = await Promise.all([
     prisma.user.count({ where: { id: payload.primaryContactId } }),
     payload.venueId
-      ? prisma.venue.count({ where: { id: payload.venueId } })
+      ? prisma.venue.count({ where: {} })
       : Promise.resolve(1),
   ]);
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": 3,

[Killed] BlockStatement
app/api/papers/route.ts:134:23
       : Promise.resolve(1),
   ]);
 
-  if (!contactExists) {
-    return NextResponse.json(
-      { error: "primaryContactId does not exist." },
-      { status: 400 },
-    );
-  }
+  if (!contactExists) {}
 
   if (payload.venueId && !venueExists) {
killedBy: /api/papers route handlers POST returns 400 when primary contact does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
app/api/papers/route.ts:134:7
       : Promise.resolve(1),
   ]);
 
-  if (!contactExists) {
+  if (false) {
     return NextResponse.json(
       { error: "primaryContactId does not exist." },
killedBy: /api/papers route handlers POST returns 400 when primary contact does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
app/api/papers/route.ts:141:7
     );
   }
 
-  if (payload.venueId && !venueExists) {
+  if (true) {
     return NextResponse.json(
       { error: "venueId does not exist." },
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
app/api/papers/route.ts:141:7
     );
   }
 
-  if (payload.venueId && !venueExists) {
+  if (false) {
     return NextResponse.json(
       { error: "venueId does not exist." },
killedBy: /api/papers route handlers POST returns 400 when venue does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
app/api/papers/route.ts:148:7
     );
   }
 
-  try {
-    const paper = await prisma.paper.create({
-      data: {
-        title: payload.title,
-        abstract: payload.abstract
-          ? payload.abstract.slice(0, 191)
-          : "",
-        status: isPaperStatus(payload.status)
-          ? payload.status
-          : DEFAULT_PAPER_STATUS,
-        submissionDate: payload.submissionDate
-          ? new Date(payload.submissionDate)
-          : null,
-        publicationDate: payload.publicationDate
-          ? new Date(payload.publicationDate)
-          : null,
-        pdfUrl: payload.pdfUrl,
-        primaryContactId: payload.primaryContactId,
-        venueId: payload.venueId,
-      },
-    });
-
-    return NextResponse.json({ paper }, { status: 201 });
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     console.error("Failed to create paper", error);
     if (error instanceof PrismaClientKnownRequestError) {
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] ObjectLiteral
app/api/papers/route.ts:149:45
   }
 
   try {
-    const paper = await prisma.paper.create({
-      data: {
-        title: payload.title,
-        abstract: payload.abstract
-          ? payload.abstract.slice(0, 191)
-          : "",
-        status: isPaperStatus(payload.status)
-          ? payload.status
-          : DEFAULT_PAPER_STATUS,
-        submissionDate: payload.submissionDate
-          ? new Date(payload.submissionDate)
-          : null,
-        publicationDate: payload.publicationDate
-          ? new Date(payload.publicationDate)
-          : null,
-        pdfUrl: payload.pdfUrl,
-        primaryContactId: payload.primaryContactId,
-        venueId: payload.venueId,
-      },
-    });
+    const paper = await prisma.paper.create({});
 
     return NextResponse.json({ paper }, { status: 201 });
killedBy: /api/papers route handlers POST creates a paper when payload passes validation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": ObjectContaining {
-     "abstract": "",

[NoCoverage] MethodExpression
app/api/papers/route.ts:153:13
       data: {
         title: payload.title,
         abstract: payload.abstract
-          ? payload.abstract.slice(0, 191)
+          ? payload.abstract
           : "",
         status: isPaperStatus(payload.status)
