[Killed] StringLiteral
app/api/papers/auth.ts:3:39
 import { NextRequest } from "next/server";
 
-const WRITE_ROLES = new Set(["admin", "principal_investigator"]);
+const WRITE_ROLES = new Set(["admin", ""]);
 const EMAIL_ROLES = new Set(["admin", "principal_investigator"]);
 
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
app/api/papers/auth.ts:4:29
 import { NextRequest } from "next/server";
 
 const WRITE_ROLES = new Set(["admin", "principal_investigator"]);
-const EMAIL_ROLES = new Set(["admin", "principal_investigator"]);
+const EMAIL_ROLES = new Set([]);
 
 export type AuthorizationResult = {
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
app/api/papers/auth.ts:4:30
 import { NextRequest } from "next/server";
 
 const WRITE_ROLES = new Set(["admin", "principal_investigator"]);
-const EMAIL_ROLES = new Set(["admin", "principal_investigator"]);
+const EMAIL_ROLES = new Set(["", "principal_investigator"]);
 
 export type AuthorizationResult = {
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/api/papers/auth.ts:15:73
 /**
  * Validates the bearer token and extracts the caller role from the request headers.
  */
-export function authorizeRequest(req: NextRequest): AuthorizationResult {
-  const token =
-    process.env.API_AUTH_TOKEN ?? process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
-  if (!token) {
-    console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
-    return {
-      authorized: false,
-      message: "Server configuration error. Contact administrator.",
-    };
-  }
-  const authHeader = req.headers.get("authorization");
-  if (!authHeader) {
-    return { authorized: false, message: "Missing Authorization header." };
-  }
-  if (authHeader !== `Bearer ${token}`) {
-    return { authorized: false, message: "Invalid credentials." };
-  }
-  return {
-    authorized: true,
-    role: req.headers.get("x-user-role")?.toLowerCase() ?? "viewer",
-  };
-}
+export function authorizeRequest(req: NextRequest): AuthorizationResult {}
 
 export function hasWritePermission(role?: string) {
killedBy: GET /api/papers/[id] returns 401 when authorization header is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'authorized')

[Killed] LogicalOperator
app/api/papers/auth.ts:17:5
  */
 export function authorizeRequest(req: NextRequest): AuthorizationResult {
   const token =
-    process.env.API_AUTH_TOKEN ?? process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
+    process.env.API_AUTH_TOKEN && process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
   if (!token) {
     console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
killedBy: GET /api/papers/[id] returns 401 when authorization header is missing
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Missing Authorization/i
Received string:  "Server configuration error. Contact administrator."

[Killed] BlockStatement
app/api/papers/auth.ts:18:15
 export function authorizeRequest(req: NextRequest): AuthorizationResult {
   const token =
     process.env.API_AUTH_TOKEN ?? process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
-  if (!token) {
-    console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
-    return {
-      authorized: false,
-      message: "Server configuration error. Contact administrator.",
-    };
-  }
+  if (!token) {}
   const authHeader = req.headers.get("authorization");
   if (!authHeader) {
killedBy: papers auth helpers rejects when API_AUTH_TOKEN is not configured
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Server configuration error/i
Received string:  "Missing Authorization header."

[Killed] ConditionalExpression
app/api/papers/auth.ts:18:7
 export function authorizeRequest(req: NextRequest): AuthorizationResult {
   const token =
     process.env.API_AUTH_TOKEN ?? process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
-  if (!token) {
+  if (false) {
     console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
     return {
killedBy: papers auth helpers rejects when API_AUTH_TOKEN is not configured
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Server configuration error/i
Received string:  "Missing Authorization header."

[Killed] StringLiteral
app/api/papers/auth.ts:19:19
   const token =
     process.env.API_AUTH_TOKEN ?? process.env.NEXT_PUBLIC_API_AUTH_TOKEN;
   if (!token) {
-    console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
+    console.error("");
     return {
       authorized: false,
killedBy: papers auth helpers rejects when API_AUTH_TOKEN is not configured
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "API_AUTH_TOKEN is not configured. Requests are denied."
Received: ""

Number of calls: 1

[Killed] BooleanLiteral
app/api/papers/auth.ts:21:19
   if (!token) {
     console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
     return {
-      authorized: false,
+      authorized: true,
       message: "Server configuration error. Contact administrator.",
     };
killedBy: papers auth helpers rejects when API_AUTH_TOKEN is not configured
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
app/api/papers/auth.ts:22:16
     console.error("API_AUTH_TOKEN is not configured. Requests are denied.");
     return {
       authorized: false,
-      message: "Server configuration error. Contact administrator.",
+      message: "",
     };
   }
killedBy: papers auth helpers rejects when API_AUTH_TOKEN is not configured
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Server configuration error/i
Received string:  ""

[Killed] StringLiteral
app/api/papers/auth.ts:25:38
       message: "Server configuration error. Contact administrator.",
     };
   }
-  const authHeader = req.headers.get("authorization");
+  const authHeader = req.headers.get("");
   if (!authHeader) {
     return { authorized: false, message: "Missing Authorization header." };
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: TypeError: Headers.get: "" is an invalid header name.

[Killed] BooleanLiteral
app/api/papers/auth.ts:26:7
     };
   }
   const authHeader = req.headers.get("authorization");
-  if (!authHeader) {
+  if (authHeader) {
     return { authorized: false, message: "Missing Authorization header." };
   }
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Missing Authorization/i
Received string:  "Invalid credentials."

[Killed] ConditionalExpression
app/api/papers/auth.ts:26:7
     };
   }
   const authHeader = req.headers.get("authorization");
-  if (!authHeader) {
+  if (true) {
     return { authorized: false, message: "Missing Authorization header." };
   }
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] BooleanLiteral
app/api/papers/auth.ts:27:26
   }
   const authHeader = req.headers.get("authorization");
   if (!authHeader) {
-    return { authorized: false, message: "Missing Authorization header." };
+    return { authorized: true, message: "Missing Authorization header." };
   }
   if (authHeader !== `Bearer ${token}`) {
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ObjectLiteral
app/api/papers/auth.ts:27:12
   }
   const authHeader = req.headers.get("authorization");
   if (!authHeader) {
-    return { authorized: false, message: "Missing Authorization header." };
+    return {};
   }
   if (authHeader !== `Bearer ${token}`) {
killedBy: /api/papers route handlers GET rejects missing authorization header
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ConditionalExpression
app/api/papers/auth.ts:29:7
   if (!authHeader) {
     return { authorized: false, message: "Missing Authorization header." };
   }
-  if (authHeader !== `Bearer ${token}`) {
+  if (false) {
     return { authorized: false, message: "Invalid credentials." };
   }
killedBy: papers auth helpers rejects when bearer token does not match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
app/api/papers/auth.ts:29:7
   if (!authHeader) {
     return { authorized: false, message: "Missing Authorization header." };
   }
-  if (authHeader !== `Bearer ${token}`) {
+  if (authHeader === `Bearer ${token}`) {
     return { authorized: false, message: "Invalid credentials." };
   }
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 401

[Killed] BooleanLiteral
app/api/papers/auth.ts:30:26
     return { authorized: false, message: "Missing Authorization header." };
   }
   if (authHeader !== `Bearer ${token}`) {
-    return { authorized: false, message: "Invalid credentials." };
+    return { authorized: true, message: "Invalid credentials." };
   }
   return {
killedBy: papers auth helpers rejects when bearer token does not match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
app/api/papers/auth.ts:33:17
     return { authorized: false, message: "Invalid credentials." };
   }
   return {
-    authorized: true,
+    authorized: false,
     role: req.headers.get("x-user-role")?.toLowerCase() ?? "viewer",
   };
killedBy: /api/papers route handlers GET returns papers using minimal contact info for viewer role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] MethodExpression
app/api/papers/auth.ts:34:11
   }
   return {
     authorized: true,
-    role: req.headers.get("x-user-role")?.toLowerCase() ?? "viewer",
+    role: req.headers.get("x-user-role")?.toUpperCase() ?? "viewer",
   };
 }
killedBy: papers auth helpers authorizes valid token and surfaces role header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "principal_investigator"
Received: "PRINCIPAL_INVESTIGATOR"

[Killed] OptionalChaining
app/api/papers/auth.ts:34:11
   }
   return {
     authorized: true,
-    role: req.headers.get("x-user-role")?.toLowerCase() ?? "viewer",
+    role: req.headers.get("x-user-role").toLowerCase() ?? "viewer",
   };
 }
killedBy: papers auth helpers defaults to viewer role when header is missing
statusReason: TypeError: Cannot read properties of null (reading 'toLowerCase')

[Killed] BlockStatement
app/api/papers/auth.ts:38:51
   };
 }
 
-export function hasWritePermission(role?: string) {
-  return Boolean(role && WRITE_ROLES.has(role));
-}
+export function hasWritePermission(role?: string) {}
 
 export function canIncludeEmails(role?: string) {
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 403

[Killed] ConditionalExpression
app/api/papers/auth.ts:39:18
 }
 
 export function hasWritePermission(role?: string) {
-  return Boolean(role && WRITE_ROLES.has(role));
+  return Boolean(true);
 }
 
killedBy: PATCH /api/papers/[id] rejects read-only roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] LogicalOperator
app/api/papers/auth.ts:39:18
 }
 
 export function hasWritePermission(role?: string) {
-  return Boolean(role && WRITE_ROLES.has(role));
+  return Boolean(role || WRITE_ROLES.has(role));
 }
 
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/api/papers/auth.ts:42:49
   return Boolean(role && WRITE_ROLES.has(role));
 }
 
-export function canIncludeEmails(role?: string) {
-  return Boolean(role && EMAIL_ROLES.has(role));
-}
+export function canIncludeEmails(role?: string) {}
 
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
app/api/papers/auth.ts:43:18
 }
 
 export function canIncludeEmails(role?: string) {
-  return Boolean(role && EMAIL_ROLES.has(role));
+  return Boolean(role || EMAIL_ROLES.has(role));
 }
 
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
app/api/papers/auth.ts:43:18
 }
 
 export function canIncludeEmails(role?: string) {
-  return Boolean(role && EMAIL_ROLES.has(role));
+  return Boolean(true);
 }
 
killedBy: papers auth helpers evaluates write and email permissions correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
