[Killed] BlockStatement
app/api/papers/route.ts:171:28
     });
 
     return NextResponse.json({ paper }, { status: 201 });
-  } catch (error: unknown) {
-    console.error("Failed to create paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
-      return NextResponse.json(
-        { error: `Invalid data: ${error.message}` },
-        { status: 400 },
-      );
-    }
-    if (error instanceof PrismaClientValidationError) {
-      return NextResponse.json(
-        { error: `Invalid payload: Field types and enums mismatch.` },
-        { status: 400 },
-      );
-    }
-    return NextResponse.json(
-      { error: "Unable to create paper. Check database connection." },
-      { status: 500 },
-    );
-  }
+  } catch (error: unknown) {}
 }
 
killedBy: /api/papers route handlers POST maps Prisma known request errors to 400
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] BlockStatement
app/api/papers/route.ts:173:57
     return NextResponse.json({ paper }, { status: 201 });
   } catch (error: unknown) {
     console.error("Failed to create paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
-      return NextResponse.json(
-        { error: `Invalid data: ${error.message}` },
-        { status: 400 },
-      );
-    }
+    if (error instanceof PrismaClientKnownRequestError) {}
     if (error instanceof PrismaClientValidationError) {
       return NextResponse.json(
killedBy: /api/papers route handlers POST maps Prisma known request errors to 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
app/api/papers/route.ts:173:9
     return NextResponse.json({ paper }, { status: 201 });
   } catch (error: unknown) {
     console.error("Failed to create paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
+    if (true) {
       return NextResponse.json(
         { error: `Invalid data: ${error.message}` },
killedBy: /api/papers route handlers POST maps Prisma validation errors to 400
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid payload/i
Received string:  "Invalid data: bad validation"

[Killed] ObjectLiteral
app/api/papers/route.ts:175:9
     console.error("Failed to create paper", error);
     if (error instanceof PrismaClientKnownRequestError) {
       return NextResponse.json(
-        { error: `Invalid data: ${error.message}` },
+        {},
         { status: 400 },
       );
killedBy: /api/papers route handlers POST maps Prisma known request errors to 400
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
app/api/papers/route.ts:175:18
     console.error("Failed to create paper", error);
     if (error instanceof PrismaClientKnownRequestError) {
       return NextResponse.json(
-        { error: `Invalid data: ${error.message}` },
+        { error: `` },
         { status: 400 },
       );
killedBy: /api/papers route handlers POST maps Prisma known request errors to 400
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid data/i
Received string:  ""

[Killed] ConditionalExpression
app/api/papers/route.ts:179:9
         { status: 400 },
       );
     }
-    if (error instanceof PrismaClientValidationError) {
+    if (true) {
       return NextResponse.json(
         { error: `Invalid payload: Field types and enums mismatch.` },
killedBy: /api/papers route handlers POST falls back to 500 for unexpected errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] ConditionalExpression
app/api/papers/route.ts:179:9
         { status: 400 },
       );
     }
-    if (error instanceof PrismaClientValidationError) {
+    if (false) {
       return NextResponse.json(
         { error: `Invalid payload: Field types and enums mismatch.` },
killedBy: /api/papers route handlers POST maps Prisma validation errors to 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ObjectLiteral
app/api/papers/route.ts:182:9
     if (error instanceof PrismaClientValidationError) {
       return NextResponse.json(
         { error: `Invalid payload: Field types and enums mismatch.` },
-        { status: 400 },
+        {},
       );
     }
killedBy: /api/papers route handlers POST maps Prisma validation errors to 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
app/api/papers/route.ts:186:16
       );
     }
     return NextResponse.json(
-      { error: "Unable to create paper. Check database connection." },
+      { error: "" },
       { status: 500 },
     );
killedBy: /api/papers route handlers POST falls back to 500 for unexpected errors
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Unable to create paper/i
Received string:  ""
