[Killed] ObjectLiteral
api/papers/[id]/route.ts:12:31
 } from "@prisma/client/runtime/library";
 import { z } from "zod";
 
-const paramsSchema = z.object({
-  id: z.coerce.number().int().positive(),
-});
+const paramsSchema = z.object({});
 
 type StoredProcedureRow = Record<string, unknown>;
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
api/papers/[id]/route.ts:24:7
 ) {
   const params = await context.params;
   const auth = authorizeRequest(req);
-  if (!auth.authorized) {
+  if (true) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 401

[Killed] BooleanLiteral
api/papers/[id]/route.ts:29:7
   }
 
   const parsed = paramsSchema.safeParse(params);
-  if (!parsed.success) {
+  if (parsed.success) {
     return NextResponse.json(
       { error: "Invalid paper ID. Must be a positive integer." },
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
api/papers/[id]/route.ts:29:24
   }
 
   const parsed = paramsSchema.safeParse(params);
-  if (!parsed.success) {
-    return NextResponse.json(
-      { error: "Invalid paper ID. Must be a positive integer." },
-      { status: 400 },
-    );
-  }
+  if (!parsed.success) {}
 
   try {
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] StringLiteral
api/papers/[id]/route.ts:31:16
   const parsed = paramsSchema.safeParse(params);
   if (!parsed.success) {
     return NextResponse.json(
-      { error: "Invalid paper ID. Must be a positive integer." },
+      { error: "" },
       { status: 400 },
     );
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid paper ID/i
Received string:  ""

[Killed] ObjectLiteral
api/papers/[id]/route.ts:31:7
   const parsed = paramsSchema.safeParse(params);
   if (!parsed.success) {
     return NextResponse.json(
-      { error: "Invalid paper ID. Must be a positive integer." },
+      {},
       { status: 400 },
     );
killedBy: GET /api/papers/[id] rejects invalid paper IDs
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
api/papers/[id]/route.ts:38:7
 
   try {
     const [rows] = await mysqlPool.query(
-      "CALL sp_get_paper_overview(?);",
+      "",
       [parsed.data.id],
     );
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "CALL sp_get_paper_overview(?);",
+ "",
  [1],

[Killed] ArrayDeclaration
api/papers/[id]/route.ts:39:7
   try {
     const [rows] = await mysqlPool.query(
       "CALL sp_get_paper_overview(?);",
-      [parsed.data.id],
+      [],
     );
 
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "CALL sp_get_paper_overview(?);",
- Array [
-   1,

[Killed] BlockStatement
api/papers/[id]/route.ts:42:31
       [parsed.data.id],
     );
 
-    if (!Array.isArray(rows)) {
-      console.error("Stored procedure returned invalid format.", { rows });
-      return NextResponse.json(
-        { error: "Stored procedure returned invalid format." },
-        { status: 500 },
-      );
-    }
+    if (!Array.isArray(rows)) {}
 
     const resultGroups = (rows as unknown[])
killedBy: GET /api/papers/[id] returns specific error when stored procedure response lacks arrays
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Stored procedure returned invalid format."
Received: "Unable to fetch paper details at this time."

[Killed] ConditionalExpression
api/papers/[id]/route.ts:42:9
       [parsed.data.id],
     );
 
-    if (!Array.isArray(rows)) {
+    if (true) {
       console.error("Stored procedure returned invalid format.", { rows });
       return NextResponse.json(
killedBy: GET /api/papers/[id] returns 404 when no paper row is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ObjectLiteral
api/papers/[id]/route.ts:43:66
     );
 
     if (!Array.isArray(rows)) {
-      console.error("Stored procedure returned invalid format.", { rows });
+      console.error("Stored procedure returned invalid format.", {});
       return NextResponse.json(
         { error: "Stored procedure returned invalid format." },
killedBy: GET /api/papers/[id] returns specific error when stored procedure response lacks arrays
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Stored procedure returned invalid format.",
- Object {
-   "rows": Object {},

[Killed] StringLiteral
api/papers/[id]/route.ts:45:18
     if (!Array.isArray(rows)) {
       console.error("Stored procedure returned invalid format.", { rows });
       return NextResponse.json(
-        { error: "Stored procedure returned invalid format." },
+        { error: "" },
         { status: 500 },
       );
killedBy: GET /api/papers/[id] returns specific error when stored procedure response lacks arrays
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Stored procedure returned invalid format."
Received: ""

[Killed] MethodExpression
api/papers/[id]/route.ts:50:26
       );
     }
 
-    const resultGroups = (rows as unknown[])
-      .filter((group) => Array.isArray(group))
+    const resultGroups = rows as unknown[]
       .map((group) => group as StoredProcedureRow[]);
 
killedBy: GET /api/papers/[id] ignores non-array groups from stored procedure output
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
api/papers/[id]/route.ts:51:15
     }
 
     const resultGroups = (rows as unknown[])
-      .filter((group) => Array.isArray(group))
+      .filter(() => undefined)
       .map((group) => group as StoredProcedureRow[]);
 
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ArrowFunction
api/papers/[id]/route.ts:52:12
 
     const resultGroups = (rows as unknown[])
       .filter((group) => Array.isArray(group))
-      .map((group) => group as StoredProcedureRow[]);
+      .map(() => undefined);
 
     const [paperGroup = [], authors = [], revisions = [], activityLog = []] =
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ArrayDeclaration
api/papers/[id]/route.ts:54:25
       .filter((group) => Array.isArray(group))
       .map((group) => group as StoredProcedureRow[]);
 
-    const [paperGroup = [], authors = [], revisions = [], activityLog = []] =
+    const [paperGroup = ["Stryker was here"], authors = [], revisions = [], activityLog = []] =
       resultGroups;
 
killedBy: GET /api/papers/[id] returns 404 when procedure output lacks any array groups
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ArrayDeclaration
api/papers/[id]/route.ts:54:73
       .filter((group) => Array.isArray(group))
       .map((group) => group as StoredProcedureRow[]);
 
-    const [paperGroup = [], authors = [], revisions = [], activityLog = []] =
+    const [paperGroup = [], authors = [], revisions = [], activityLog = ["Stryker was here"]] =
       resultGroups;
 
killedBy: GET /api/papers/[id] defaults nested groups to empty arrays when missing
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  ["Stryker was here"]

[Killed] ConditionalExpression
api/papers/[id]/route.ts:58:9
       resultGroups;
 
     const paper = paperGroup[0];
-    if (!paper) {
+    if (true) {
       return NextResponse.json(
         { error: "Paper not found." },
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
api/papers/[id]/route.ts:58:9
       resultGroups;
 
     const paper = paperGroup[0];
-    if (!paper) {
+    if (false) {
       return NextResponse.json(
         { error: "Paper not found." },
killedBy: GET /api/papers/[id] returns 404 when no paper row is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ObjectLiteral
api/papers/[id]/route.ts:60:9
     const paper = paperGroup[0];
     if (!paper) {
       return NextResponse.json(
-        { error: "Paper not found." },
+        {},
         { status: 404 },
       );
killedBy: GET /api/papers/[id] returns 404 when no paper row is found
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
api/papers/[id]/route.ts:60:18
     const paper = paperGroup[0];
     if (!paper) {
       return NextResponse.json(
-        { error: "Paper not found." },
+        { error: "" },
         { status: 404 },
       );
killedBy: GET /api/papers/[id] returns 404 when no paper row is found
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Paper not found/i
Received string:  ""

[Killed] ObjectLiteral
api/papers/[id]/route.ts:65:30
       );
     }
 
-    return NextResponse.json({
-      paper,
-      authors,
-      revisions,
-      activityLog,
-    });
+    return NextResponse.json({});
   } catch (error) {
     console.error("Failed to fetch paper overview", error);
killedBy: GET /api/papers/[id] returns overview data when stored procedure succeeds
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": 1, "title": "Paper"}
Received: undefined

[Killed] BlockStatement
api/papers/[id]/route.ts:71:19
       revisions,
       activityLog,
     });
-  } catch (error) {
-    console.error("Failed to fetch paper overview", error);
-    return NextResponse.json(
-      { error: "Unable to fetch paper details at this time." },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: GET /api/papers/[id] returns 500 when mysql query rejects
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] MethodExpression
api/papers/[id]/route.ts:81:24
 }
 
 const MAX_ABSTRACT_LENGTH = 191;
-const abstractSchema = z.string().max(MAX_ABSTRACT_LENGTH);
+const abstractSchema = z.string().min(MAX_ABSTRACT_LENGTH);
 
 const updateSchema = z.object({
killedBy: PATCH /api/papers/[id] updates abstract when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
api/papers/[id]/route.ts:83:31
 const MAX_ABSTRACT_LENGTH = 191;
 const abstractSchema = z.string().max(MAX_ABSTRACT_LENGTH);
 
-const updateSchema = z.object({
-  title: z.string().min(3).max(191).optional(),
-  abstract: abstractSchema.optional(),
-  status: z.string().optional(),
-});
+const updateSchema = z.object({});
 
 const isPaperStatus = (value: unknown): value is PaperStatus =>
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] MethodExpression
api/papers/[id]/route.ts:84:10
 const abstractSchema = z.string().max(MAX_ABSTRACT_LENGTH);
 
 const updateSchema = z.object({
-  title: z.string().min(3).max(191).optional(),
+  title: z.string().max(3).max(191).optional(),
   abstract: abstractSchema.optional(),
   status: z.string().optional(),
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] MethodExpression
api/papers/[id]/route.ts:84:10
 const abstractSchema = z.string().max(MAX_ABSTRACT_LENGTH);
 
 const updateSchema = z.object({
-  title: z.string().min(3).max(191).optional(),
+  title: z.string().min(3).min(191).optional(),
   abstract: abstractSchema.optional(),
   status: z.string().optional(),
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ArrowFunction
api/papers/[id]/route.ts:89:23
   status: z.string().optional(),
 });
 
-const isPaperStatus = (value: unknown): value is PaperStatus =>
-  typeof value === "string" &&
-  PAPER_STATUSES.includes(value as PaperStatus);
+const isPaperStatus = () => undefined;
 
 export async function PATCH(
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
api/papers/[id]/route.ts:90:3
 });
 
 const isPaperStatus = (value: unknown): value is PaperStatus =>
-  typeof value === "string" &&
-  PAPER_STATUSES.includes(value as PaperStatus);
+  false;
 
 export async function PATCH(
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
api/papers/[id]/route.ts:90:3
 });
 
 const isPaperStatus = (value: unknown): value is PaperStatus =>
-  typeof value === "string" &&
-  PAPER_STATUSES.includes(value as PaperStatus);
+  typeof value === "string" || PAPER_STATUSES.includes(value as PaperStatus);
 
 export async function PATCH(
killedBy: PATCH /api/papers/[id] rejects unsupported statuses
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Unsupported status/i
Received string:  "Validation error while updating paper."

[Killed] ObjectLiteral
api/papers/[id]/route.ts:100:55
   const params = await context.params;
   const auth = authorizeRequest(req);
   if (!auth.authorized) {
-    return NextResponse.json({ error: auth.message }, { status: 401 });
+    return NextResponse.json({ error: auth.message }, {});
   }
   if (!hasWritePermission(auth.role)) {
killedBy: PATCH /api/papers/[id] rejects unauthorized requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] BlockStatement
api/papers/[id]/route.ts:102:39
   if (!auth.authorized) {
     return NextResponse.json({ error: auth.message }, { status: 401 });
   }
-  if (!hasWritePermission(auth.role)) {
-    return NextResponse.json(
-      { error: "Insufficient permissions." },
-      { status: 403 },
-    );
-  }
+  if (!hasWritePermission(auth.role)) {}
 
   const parsed = paramsSchema.safeParse(params);
killedBy: PATCH /api/papers/[id] rejects read-only roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Killed] ConditionalExpression
api/papers/[id]/route.ts:110:7
   }
 
   const parsed = paramsSchema.safeParse(params);
-  if (!parsed.success) {
+  if (false) {
     return NextResponse.json(
       { error: "Invalid paper ID." },
killedBy: PATCH /api/papers/[id] returns 400 when params are invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Survived] ArrowFunction
api/papers/[id]/route.ts:117:65
     );
   }
 
-  const payload = updateSchema.safeParse(await req.json().catch(() => ({})));
+  const payload = updateSchema.safeParse(await req.json().catch(() => undefined));
   if (!payload.success) {
     return NextResponse.json(

[Killed] ConditionalExpression
api/papers/[id]/route.ts:118:7
   }
 
   const payload = updateSchema.safeParse(await req.json().catch(() => ({})));
-  if (!payload.success) {
+  if (true) {
     return NextResponse.json(
       { error: "Invalid payload." },
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Include at least one field/i
Received string:  "Invalid payload."

[Killed] BooleanLiteral
api/papers/[id]/route.ts:118:7
   }
 
   const payload = updateSchema.safeParse(await req.json().catch(() => ({})));
-  if (!payload.success) {
+  if (payload.success) {
     return NextResponse.json(
       { error: "Invalid payload." },
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Include at least one field/i
Received string:  "Invalid payload."

[Killed] StringLiteral
api/papers/[id]/route.ts:120:16
   const payload = updateSchema.safeParse(await req.json().catch(() => ({})));
   if (!payload.success) {
     return NextResponse.json(
-      { error: "Invalid payload." },
+      { error: "" },
       { status: 400 },
     );
killedBy: PATCH /api/papers/[id] rejects payloads that fail schema validation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Invalid payload/i
Received string:  ""

[Killed] BlockStatement
api/papers/[id]/route.ts:126:27
   }
 
   const updateData: Record<string, unknown> = {};
-  if (payload.data.title) {
-    updateData.title = payload.data.title;
-  }
+  if (payload.data.title) {}
   if (payload.data.abstract !== undefined) {
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "status": "Draft",

[Killed] ConditionalExpression
api/papers/[id]/route.ts:126:7
   }
 
   const updateData: Record<string, unknown> = {};
-  if (payload.data.title) {
+  if (false) {
     updateData.title = payload.data.title;
   }
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "status": "Draft",

[Killed] BlockStatement
api/papers/[id]/route.ts:129:44
   if (payload.data.title) {
     updateData.title = payload.data.title;
   }
-  if (payload.data.abstract !== undefined) {
-    const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
-    updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
-  }
+  if (payload.data.abstract !== undefined) {}
   if (payload.data.status) {
     if (!isPaperStatus(payload.data.status)) {
killedBy: PATCH /api/papers/[id] updates abstract when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
api/papers/[id]/route.ts:129:7
   if (payload.data.title) {
     updateData.title = payload.data.title;
   }
-  if (payload.data.abstract !== undefined) {
+  if (true) {
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: ZodError: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [],
    "message": "Invalid input: expected string, received undefined"
  }
]

[Survived] MethodExpression
api/papers/[id]/route.ts:131:27
   }
   if (payload.data.abstract !== undefined) {
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
-    updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
+    updateData.abstract = normalizedAbstract;
   }
   if (payload.data.status) {

[Killed] ConditionalExpression
api/papers/[id]/route.ts:133:7
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
-  if (payload.data.status) {
+  if (false) {
     if (!isPaperStatus(payload.data.status)) {
       return NextResponse.json(
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,7 @@
  Object {
    "data": Object {

[Killed] ConditionalExpression
api/papers/[id]/route.ts:133:7
     const normalizedAbstract = abstractSchema.parse(payload.data.abstract);
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
-  if (payload.data.status) {
+  if (true) {
     if (!isPaperStatus(payload.data.status)) {
       return NextResponse.json(
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Include at least one field/i
Received string:  "Unsupported status value."

[Killed] BlockStatement
api/papers/[id]/route.ts:134:46
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
   if (payload.data.status) {
-    if (!isPaperStatus(payload.data.status)) {
-      return NextResponse.json(
-        { error: "Unsupported status value." },
-        { status: 400 },
-      );
-    }
+    if (!isPaperStatus(payload.data.status)) {}
     updateData.status = payload.data.status;
   }
killedBy: PATCH /api/papers/[id] rejects unsupported statuses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
api/papers/[id]/route.ts:134:9
     updateData.abstract = normalizedAbstract.slice(0, MAX_ABSTRACT_LENGTH);
   }
   if (payload.data.status) {
-    if (!isPaperStatus(payload.data.status)) {
+    if (false) {
       return NextResponse.json(
         { error: "Unsupported status value." },
killedBy: PATCH /api/papers/[id] rejects unsupported statuses
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Unsupported status/i
Received string:  "Validation error while updating paper."

[Killed] StringLiteral
api/papers/[id]/route.ts:136:18
   if (payload.data.status) {
     if (!isPaperStatus(payload.data.status)) {
       return NextResponse.json(
-        { error: "Unsupported status value." },
+        { error: "" },
         { status: 400 },
       );
killedBy: PATCH /api/papers/[id] rejects unsupported statuses
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Unsupported status/i
Received string:  ""

[Killed] ConditionalExpression
api/papers/[id]/route.ts:143:7
     updateData.status = payload.data.status;
   }
 
-  if (Object.keys(updateData).length === 0) {
+  if (true) {
     return NextResponse.json(
       { error: "Include at least one field to update." },
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
api/papers/[id]/route.ts:143:45
     updateData.status = payload.data.status;
   }
 
-  if (Object.keys(updateData).length === 0) {
-    return NextResponse.json(
-      { error: "Include at least one field to update." },
-      { status: 400 },
-    );
-  }
+  if (Object.keys(updateData).length === 0) {}
 
   try {
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
api/papers/[id]/route.ts:145:16
 
   if (Object.keys(updateData).length === 0) {
     return NextResponse.json(
-      { error: "Include at least one field to update." },
+      { error: "" },
       { status: 400 },
     );
killedBy: PATCH /api/papers/[id] validates payload fields
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Include at least one field/i
Received string:  ""

[Killed] BlockStatement
api/papers/[id]/route.ts:150:7
     );
   }
 
-  try {
-    const updated = await prisma.paper.update({
-      where: { id: parsed.data.id },
-      data: updateData,
-    });
-
-    return NextResponse.json({ paper: updated });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Failed to update paper", error);
     if (error instanceof PrismaClientKnownRequestError) {
killedBy: PATCH /api/papers/[id] updates paper metadata when payload is valid
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Killed] BlockStatement
api/papers/[id]/route.ts:157:19
     });
 
     return NextResponse.json({ paper: updated });
-  } catch (error) {
-    console.error("Failed to update paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
-      return NextResponse.json(
-        { error: `Database error: ${error.message}` },
-        { status: 400 },
-      );
-    }
-    if (error instanceof PrismaClientValidationError) {
-      return NextResponse.json(
-        { error: "Validation error while updating paper." },
-        { status: 400 },
-      );
-    }
-    return NextResponse.json(
-      { error: "Unable to update paper right now." },
-      { status: 500 },
-    );
-  }
+  } catch (error) {}
 }
 
killedBy: PATCH /api/papers/[id] maps Prisma known request errors
statusReason: TypeError: Cannot read properties of undefined (reading 'json')

[Survived] StringLiteral
api/papers/[id]/route.ts:158:19
 
     return NextResponse.json({ paper: updated });
   } catch (error) {
-    console.error("Failed to update paper", error);
+    console.error("", error);
     if (error instanceof PrismaClientKnownRequestError) {
       return NextResponse.json(

[Killed] BlockStatement
api/papers/[id]/route.ts:159:57
     return NextResponse.json({ paper: updated });
   } catch (error) {
     console.error("Failed to update paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
-      return NextResponse.json(
-        { error: `Database error: ${error.message}` },
-        { status: 400 },
-      );
-    }
+    if (error instanceof PrismaClientKnownRequestError) {}
     if (error instanceof PrismaClientValidationError) {
       return NextResponse.json(
killedBy: PATCH /api/papers/[id] maps Prisma known request errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
api/papers/[id]/route.ts:159:9
     return NextResponse.json({ paper: updated });
   } catch (error) {
     console.error("Failed to update paper", error);
-    if (error instanceof PrismaClientKnownRequestError) {
+    if (false) {
       return NextResponse.json(
         { error: `Database error: ${error.message}` },
killedBy: PATCH /api/papers/[id] maps Prisma known request errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ObjectLiteral
api/papers/[id]/route.ts:161:9
     console.error("Failed to update paper", error);
     if (error instanceof PrismaClientKnownRequestError) {
       return NextResponse.json(
-        { error: `Database error: ${error.message}` },
+        {},
         { status: 400 },
       );
killedBy: PATCH /api/papers/[id] maps Prisma known request errors
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ObjectLiteral
api/papers/[id]/route.ts:162:9
     if (error instanceof PrismaClientKnownRequestError) {
       return NextResponse.json(
         { error: `Database error: ${error.message}` },
-        { status: 400 },
+        {},
       );
     }
killedBy: PATCH /api/papers/[id] maps Prisma known request errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
api/papers/[id]/route.ts:167:9
     }
     if (error instanceof PrismaClientValidationError) {
       return NextResponse.json(
-        { error: "Validation error while updating paper." },
+        {},
         { status: 400 },
       );
killedBy: PATCH /api/papers/[id] maps validation errors
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ObjectLiteral
api/papers/[id]/route.ts:168:9
     if (error instanceof PrismaClientValidationError) {
       return NextResponse.json(
         { error: "Validation error while updating paper." },
-        { status: 400 },
+        {},
       );
     }
killedBy: PATCH /api/papers/[id] maps validation errors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
api/papers/[id]/route.ts:172:7
       );
     }
     return NextResponse.json(
-      { error: "Unable to update paper right now." },
+      {},
       { status: 500 },
     );
killedBy: PATCH /api/papers/[id] handles unexpected errors
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined
